{
  "standards": [
    {
      "id": "iso_21434",
      "full_name": "ISO/SAE 21434:2021",
      "title": "Road vehicles — Cybersecurity engineering",
      "version": "2021",
      "note": "Standard text requires paid license. Clause IDs and expert guidance provided."
    },
    {
      "id": "tisax",
      "full_name": "VDA ISA / TISAX",
      "title": "Trusted Information Security Assessment Exchange",
      "version": "6.0",
      "note": "VDA Information Security Assessment catalog. Required for German OEM supplier qualification. Assessment levels AL1-AL3."
    },
    {
      "id": "sae_j3061",
      "full_name": "SAE J3061",
      "title": "Cybersecurity Guidebook for Cyber-Physical Vehicle Systems",
      "version": "2016",
      "note": "SAE recommended practice. Predecessor to ISO 21434. Still referenced in legacy programs."
    },
    {
      "id": "autosar",
      "full_name": "AUTOSAR Cybersecurity",
      "title": "AUTOSAR Specification of Secure Onboard Communication",
      "version": "R22-11",
      "note": "AUTOSAR security specifications for ECU communication. Includes SecOC, Crypto Stack, and security modules."
    },
    {
      "id": "gbt",
      "full_name": "GB/T Automotive Cybersecurity Standards",
      "title": "Chinese National Standards for Vehicle Cybersecurity",
      "version": "2024",
      "note": "Mandatory standards for China market entry. Includes GB/T 40857, GB/T 40856, GB/T 40855, and related standards."
    }
  ],
  "clauses": [
    {
      "standard": "iso_21434",
      "clause_id": "5",
      "title": "Organizational cybersecurity management",
      "guidance": "Establishes the foundation for cybersecurity governance within an organization. Requires defining a cybersecurity policy, assigning roles and responsibilities, establishing a cybersecurity culture, and ensuring competence of personnel. Key activities include: (1) Create and maintain a cybersecurity policy approved by top management; (2) Define organizational structure with clear cybersecurity responsibilities; (3) Establish processes for cybersecurity awareness and training; (4) Implement continuous improvement mechanisms. This clause maps to R155 Article 7.2.2.2(a) - processes used within the manufacturer's organization to manage cybersecurity.",
      "work_products": ["[WP-05-01] Cybersecurity policy", "[WP-05-02] Organizational cybersecurity rules", "[WP-05-03] Evidence of competence"],
      "r155_mapping": ["7.2.2.2(a)"],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "6",
      "title": "Project dependent cybersecurity management",
      "guidance": "Defines how to manage cybersecurity at the project level. The cybersecurity case is the central artifact - a structured argument demonstrating that cybersecurity risks are managed appropriately. Key requirements: (1) Cybersecurity planning - define activities, responsibilities, and timing; (2) Cybersecurity case - collect evidence that cybersecurity goals are achieved; (3) Cybersecurity assessment - independent evaluation of the cybersecurity case; (4) Release for post-development - formal handover criteria. The cybersecurity case must be maintained throughout the vehicle lifecycle and updated when new threats emerge or design changes occur. Auditors will primarily examine your cybersecurity case for type approval evidence.",
      "work_products": ["[WP-06-01] Cybersecurity plan", "[WP-06-02] Cybersecurity case", "[WP-06-03] Cybersecurity assessment report", "[WP-06-04] Release for post-development report"],
      "r155_mapping": ["5.1.1(b)", "7.3.1"],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "7",
      "title": "Distributed cybersecurity activities",
      "guidance": "Addresses cybersecurity when work is distributed across organizations (OEM-supplier relationships). Defines the Cybersecurity Interface Agreement (CIA) as the key mechanism. Requirements include: (1) Define clear interfaces between customer and supplier; (2) Agree on cybersecurity responsibilities via CIA; (3) Establish information sharing protocols for vulnerabilities and incidents; (4) Define how to handle cybersecurity requirements flow-down. Critical for Tier 1/2 suppliers: your customer (OEM) will require you to demonstrate compliance via CIA. The CIA should specify: shared vs. exclusive responsibilities, required work products, vulnerability disclosure timelines, and audit rights.",
      "work_products": ["[WP-07-01] Cybersecurity interface agreement"],
      "r155_mapping": ["5.1.1(a)", "7.2.2.5", "7.3.2"],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "8",
      "title": "Continual cybersecurity activities",
      "guidance": "Covers ongoing cybersecurity activities throughout the vehicle lifecycle. Four main areas: (1) Cybersecurity monitoring - track threat landscape, vulnerability databases (CVE, NVD), and automotive-specific sources (Auto-ISAC); (2) Cybersecurity event evaluation - assess relevance of new threats/vulnerabilities to your products; (3) Vulnerability analysis - determine exploitability and impact; (4) Vulnerability management - triage, remediation planning, and tracking. Key insight: This clause operationalizes the 'post-production' monitoring required by R155 Article 7.2.2.2(g). You need processes to detect new vulnerabilities affecting deployed vehicles and respond within defined timelines.",
      "work_products": ["[WP-08-01] Cybersecurity monitoring report", "[WP-08-02] Cybersecurity event evaluation", "[WP-08-03] Vulnerability analysis report", "[WP-08-04] Vulnerability management report"],
      "r155_mapping": ["7.2.2.2(f)", "7.2.2.2(g)", "7.2.2.3", "7.2.2.4"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "9",
      "title": "Concept phase",
      "guidance": "Initiates cybersecurity engineering for a new item or component. Key activities: (1) Item definition - describe the item, its boundaries, functions, and interfaces; (2) Cybersecurity relevance determination - decide if cybersecurity applies; (3) If relevant, initiate TARA (Clause 15). The item definition must include: preliminary architecture, external interfaces, trust boundaries, assets to protect, and operating environment assumptions. This phase produces the foundation for all subsequent cybersecurity analysis. Tip: Get the item definition right - errors here propagate through the entire TARA.",
      "work_products": ["[WP-09-01] Item definition", "[WP-09-02] Cybersecurity relevance decision"],
      "r155_mapping": ["7.3.3"],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "9.3",
      "title": "Vulnerability analysis",
      "guidance": "Monitor for vulnerabilities in components throughout vehicle lifetime. Establish processes for vulnerability disclosure, triage, and remediation. Interface with PSIRT for coordination. Key activities: (1) Identify known vulnerabilities in components (CVE monitoring); (2) Assess vulnerability applicability to your implementation; (3) Determine exploitability in automotive context; (4) Prioritize based on risk. Tools: vulnerability scanners, SBOM analysis, threat intelligence feeds.",
      "work_products": ["[WP-09-03] Vulnerability analysis report"],
      "r155_mapping": ["7.2.2.2(g)"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "10",
      "title": "Product development phase",
      "guidance": "Integrates cybersecurity into the product development lifecycle. Two main sub-phases: (1) Design - refine cybersecurity requirements, design cybersecurity controls, specify secure architecture; (2) Integration and verification - implement controls, verify they work as intended, validate against cybersecurity goals. Key principle: cybersecurity requirements must be traceable from TARA through design to verification. Each cybersecurity goal should have corresponding requirements, design decisions, implementation, and test evidence. This forms the 'vertical slice' auditors examine.",
      "work_products": ["[WP-10-01] Refined cybersecurity requirements", "[WP-10-02] Cybersecurity specifications", "[WP-10-03] Cybersecurity design verification report", "[WP-10-04] Integration and verification specification", "[WP-10-05] Verification report"],
      "r155_mapping": ["5.1.1(c)", "5.1.1(d)", "7.3.4", "7.3.6"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "11",
      "title": "Cybersecurity validation",
      "guidance": "Confirms that cybersecurity goals are achieved at the vehicle level. Distinct from verification (Clause 10): validation answers 'did we build the right thing?' while verification answers 'did we build the thing right?'. Key activities: (1) Define validation criteria based on cybersecurity goals; (2) Execute validation tests (penetration testing, fuzz testing, attack simulations); (3) Confirm residual risk is acceptable. Validation should include realistic attack scenarios from TARA. Consider engaging independent penetration testers for objective assessment.",
      "work_products": ["[WP-11-01] Validation specification", "[WP-11-02] Validation report"],
      "r155_mapping": ["5.1.2", "7.3.6"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "12",
      "title": "Production phase",
      "guidance": "Ensures cybersecurity is maintained during manufacturing. Key concerns: (1) Protect cryptographic material during production (key injection, secure provisioning); (2) Maintain integrity of software/firmware flashing; (3) Prevent tampering with security configurations; (4) Control access to production systems and tools. Production cybersecurity often involves: HSMs for key management, secure boot chain initialization, production line network segmentation, and audit trails for security-critical operations.",
      "work_products": ["[WP-12-01] Production control plan"],
      "r155_mapping": ["7.2.2.1(b)"],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "13",
      "title": "Operations and maintenance phase",
      "guidance": "Covers cybersecurity during vehicle operation in the field. Two main activities: (1) Cybersecurity incident response - detect, analyze, contain, and remediate incidents affecting vehicles; (2) Updates - manage security patches and software updates. Requires: incident response plan, communication channels with vehicle owners, coordination with authorities (if applicable), and update deployment mechanisms. This clause works closely with R156 (Software Updates) - your SUMS must support secure update delivery.",
      "work_products": ["[WP-13-01] Incident response plan", "[WP-13-02] Cybersecurity update documentation"],
      "r155_mapping": ["7.2.2.2(g)", "7.2.2.2(h)", "7.3.7"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "14",
      "title": "End of cybersecurity support and decommissioning",
      "guidance": "Addresses end-of-life cybersecurity considerations. Key activities: (1) Define cybersecurity support period - how long will you provide security updates?; (2) Communicate end-of-support to vehicle owners; (3) Consider decommissioning procedures - data erasure, certificate revocation, service discontinuation. Important: R155 requires demonstrating cybersecurity throughout the 'post-production phase' until end-of-life. Your end-of-support policy affects type approval commitments.",
      "work_products": ["[WP-14-01] End of cybersecurity support communication", "[WP-14-02] Decommissioning procedure"],
      "r155_mapping": ["7.2.2.1(c)"],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "15",
      "title": "Threat analysis and risk assessment (TARA)",
      "guidance": "The core methodology for identifying and assessing cybersecurity risks. TARA is the most important clause for daily work - it drives all cybersecurity decisions. Process steps: (1) Asset identification - what needs protection (safety functions, PII, IP, availability); (2) Threat scenario identification - how could assets be compromised? Use STRIDE, attack trees, or threat libraries; (3) Impact rating - consequences if threat succeeds (safety, financial, operational, privacy); (4) Attack path analysis - how would an attacker reach the asset?; (5) Attack feasibility rating - how difficult is the attack? Consider elapsed time, expertise, knowledge, window of opportunity, equipment (see Annex G); (6) Risk determination - combine impact and attack feasibility; (7) Risk treatment - accept, avoid, transfer, or mitigate. Key outputs: threat scenarios, attack feasibility ratings, risk values, and cybersecurity goals. Each unacceptable risk must have a corresponding cybersecurity goal. TARA must be maintained - update when architecture changes or new threats emerge.",
      "work_products": ["[WP-15-01] TARA report", "[WP-15-02] Asset identification", "[WP-15-03] Threat scenarios", "[WP-15-04] Impact ratings", "[WP-15-05] Attack path analysis", "[WP-15-06] Attack feasibility ratings", "[WP-15-07] Risk values", "[WP-15-08] Risk treatment decisions", "[WP-15-09] Cybersecurity goals"],
      "r155_mapping": ["5.1.1(b)", "5.1.3(a)", "7.2.2.2(b)", "7.2.2.2(c)", "7.2.2.2(d)", "7.3.3", "7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "15.3",
      "title": "Asset identification",
      "guidance": "First step of TARA: identify what needs protection. Assets include: (1) Cybersecurity properties - confidentiality, integrity, availability of vehicle functions; (2) Safety-related assets - functions where compromise could cause physical harm; (3) Data assets - PII, cryptographic keys, calibration data, diagnostic data; (4) Financial assets - odometer, usage data affecting resale; (5) Operational assets - functions needed for vehicle operation. Method: analyze item definition, identify trust boundaries, list assets at each boundary. Prioritize assets by damage potential. Tip: Start with safety-critical functions, then work outward to convenience features.",
      "work_products": ["[WP-15-02] Asset identification"],
      "r155_mapping": ["7.3.3"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "15.4",
      "title": "Threat scenario identification",
      "guidance": "Identify how assets could be compromised. Methods: (1) STRIDE - Spoofing, Tampering, Repudiation, Information disclosure, Denial of service, Elevation of privilege; (2) Attack trees - decompose high-level threats into attack steps; (3) Threat libraries - use R155 Annex 5 as starting point (70+ automotive threats); (4) Brainstorming with security experts. For each asset, ask: Who might attack? Why? How? Consider: remote attackers, malicious insiders, supply chain compromise, physical attackers. Output: list of threat scenarios with attacker motivation and high-level attack description.",
      "work_products": ["[WP-15-03] Threat scenarios"],
      "r155_mapping": ["7.2.2.2(b)", "7.3.3"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "15.5",
      "title": "Impact rating",
      "guidance": "Assess consequences if a threat scenario succeeds. Impact categories: (1) Safety - injury severity (use ISO 26262 ASIL logic: S0-S3); (2) Financial - direct costs, liability, recall expenses; (3) Operational - vehicle functionality degradation; (4) Privacy - PII exposure severity. Rating scale typically: Negligible, Moderate, Major, Severe. The highest impact across categories determines overall impact. Document rationale for each rating. Impact should be assessed assuming successful attack with no mitigations in place.",
      "work_products": ["[WP-15-04] Impact ratings"],
      "r155_mapping": ["7.2.2.2(c)", "7.3.3"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "15.6",
      "title": "Attack path analysis",
      "guidance": "Determine how an attacker could reach and exploit the asset. Analyze: (1) Entry points - external interfaces (OBD-II, Bluetooth, cellular, USB, WiFi, DSRC); (2) Intermediate steps - internal network traversal, privilege escalation; (3) Target access - how to reach the asset from entry point. Output: attack paths showing sequence of steps. Consider: network segmentation, authentication requirements, physical access needs. Attack paths inform attack feasibility - longer paths with more barriers are harder to execute.",
      "work_products": ["[WP-15-05] Attack path analysis"],
      "r155_mapping": ["7.3.3"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "15.7",
      "title": "Attack feasibility rating",
      "guidance": "Assess how difficult it is to execute the attack. ISO 21434 Annex G provides a method using five factors: (1) Elapsed time - how long to develop and execute attack (hours to years); (2) Specialist expertise - attacker skill level needed (layman to multiple experts); (3) Knowledge of item - information needed about target (public to critical insider); (4) Window of opportunity - access conditions (unlimited to very limited); (5) Equipment - tools required (standard to bespoke). Each factor rated 0-∞, summed to get attack potential. Lower sum = higher feasibility. Alternative: use attack probability based on industry data. Document assumptions clearly.",
      "work_products": ["[WP-15-06] Attack feasibility ratings"],
      "r155_mapping": ["7.2.2.2(c)", "7.3.3"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "15.8",
      "title": "Risk determination",
      "guidance": "Combine impact and attack feasibility to determine risk level. Typical risk matrix: Impact (rows) × Feasibility (columns) = Risk (1-5 or Low/Medium/High/Critical). Define risk acceptance criteria: which risk levels require treatment? Example: Critical and High risks must be mitigated, Medium risks require justification for acceptance, Low risks can be accepted. Document risk values for each threat scenario. This prioritizes your security engineering effort - focus on highest risks first.",
      "work_products": ["[WP-15-07] Risk values"],
      "r155_mapping": ["7.2.2.2(c)", "7.3.3"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "15.9",
      "title": "Risk treatment",
      "guidance": "Decide how to handle each identified risk. Options: (1) Avoid - remove the feature/function causing risk; (2) Reduce - implement mitigations (most common); (3) Share - transfer risk via insurance, contracts, or design choices; (4) Retain - accept the risk with justification. For risks requiring reduction: define cybersecurity goals stating what security property must be achieved. Goals should be SMART: Specific, Measurable, Achievable, Relevant, Time-bound. Example goal: 'Prevent unauthorized firmware modification' not 'Make system secure'. Each goal flows into Clause 10 as cybersecurity requirements.",
      "work_products": ["[WP-15-08] Risk treatment decisions", "[WP-15-09] Cybersecurity goals"],
      "r155_mapping": ["7.2.2.2(d)", "7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "Annex A",
      "title": "Cybersecurity Assurance Levels (CAL)",
      "guidance": "CAL provides a mechanism to scale cybersecurity rigor based on risk. Four levels: CAL 1 (lowest) to CAL 4 (highest). Higher CAL requires more rigorous methods, more independence in verification, and more comprehensive documentation. CAL is assigned based on: impact severity, attack feasibility, and stakeholder requirements. Typical mapping: Safety-critical functions → CAL 3-4; Privacy-critical → CAL 2-3; Convenience features → CAL 1-2. CAL influences work product depth, review requirements, and testing intensity. Note: CAL is informative in ISO 21434, but customers often mandate specific CAL levels contractually.",
      "work_products": [],
      "r155_mapping": [],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "Annex D",
      "title": "Cybersecurity relevance example",
      "guidance": "Provides guidance for determining if cybersecurity analysis applies to an item. Decision factors: (1) Does the item have electrical/electronic components?; (2) Does it connect to external interfaces?; (3) Does it process, store, or transmit data?; (4) Could compromise affect safety, privacy, financial, or operational aspects? If any answer is 'yes' and potential for cyber threats exists, cybersecurity is relevant. Most modern automotive components are cybersecurity-relevant due to connectivity. When in doubt, apply TARA - it's better to analyze and find no risk than to skip analysis and miss threats.",
      "work_products": [],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "Annex E",
      "title": "Cybersecurity interface agreement considerations",
      "guidance": "Details what should be included in a Cybersecurity Interface Agreement (CIA) between customer and supplier. Key elements: (1) Scope - which items/components covered; (2) Responsibility matrix - who does what for each ISO 21434 clause; (3) Work product exchange - which artifacts shared, in what format; (4) Vulnerability handling - disclosure timelines, coordination procedures; (5) Incident response - notification requirements, joint response procedures; (6) Change management - how to handle design changes affecting cybersecurity; (7) Audit rights - customer access to supplier evidence. Tip: Define CIA early in supplier selection - it affects supplier capability requirements.",
      "work_products": [],
      "r155_mapping": ["7.2.2.5", "7.3.2"],
      "cal_relevant": 0
    },
    {
      "standard": "iso_21434",
      "clause_id": "Annex F",
      "title": "Vulnerability scoring systems guidance",
      "guidance": "Provides guidance on using vulnerability scoring systems like CVSS (Common Vulnerability Scoring System). Key considerations for automotive: (1) Base score may not reflect automotive context - a 'critical' IT vulnerability might be 'medium' in isolated automotive ECU; (2) Consider environmental score adjustments for your specific implementation; (3) Temporal score changes as exploits become available; (4) CVSS alone is insufficient - combine with automotive-specific impact assessment. Recommendation: Use CVSS as input, but apply automotive-specific attack feasibility and impact analysis per Clause 15.",
      "work_products": [],
      "r155_mapping": ["7.2.2.2(g)"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "Annex G",
      "title": "Attack feasibility rating methods",
      "guidance": "Defines methods for rating attack feasibility. Primary method: Attack Potential approach with five factors: (1) Elapsed time - 0 (≤1 day) to 19 (>6 months); (2) Expertise - 0 (layman) to 8 (multiple experts); (3) Knowledge - 0 (public) to 11 (critical/restricted); (4) Window of opportunity - 0 (unlimited) to 10 (very difficult); (5) Equipment - 0 (standard) to 9 (bespoke). Sum factors to get attack potential: 0-9 (basic), 10-13 (enhanced-basic), 14-19 (moderate), 20-24 (high), 25+ (beyond high). Alternative: CVSS-based approach for known vulnerabilities. Choose method consistently across your organization.",
      "work_products": [],
      "r155_mapping": ["7.2.2.2(c)", "7.3.3"],
      "cal_relevant": 1
    },
    {
      "standard": "iso_21434",
      "clause_id": "Annex H",
      "title": "Example TARA methods",
      "guidance": "Provides example approaches for conducting TARA. Methods include: (1) STRIDE per element - apply STRIDE to each component in architecture; (2) Attack trees - decompose threats into attack steps; (3) HEAVENS (HEAling Vulnerabilities to ENhance Software Security) - automotive-specific method; (4) EVITA - European research project method; (5) TVRA (Threat Vulnerability and Risk Analysis) - ETSI method adapted for automotive. No single method is mandated - choose based on organizational experience and customer requirements. Key: whatever method used, ensure it systematically identifies threats and rates risks consistently.",
      "work_products": [],
      "r155_mapping": [],
      "cal_relevant": 1
    },
    {
      "standard": "tisax",
      "clause_id": "Overview",
      "title": "TISAX Overview and Assessment Levels",
      "guidance": "TISAX (Trusted Information Security Assessment Exchange) is the automotive industry's information security assessment standard, managed by ENX Association. Key concepts: (1) Assessment Levels - AL1 (normal protection, self-assessment), AL2 (high protection, remote assessment), AL3 (very high protection, on-site assessment); (2) Scope Labels - 'Info high' for confidential data, 'Info very high' for strictly confidential, 'Proto' for prototype protection, 'Vehicle' for test vehicles; (3) Validity - 3 years from assessment date; (4) Exchange - Results shared via ENX portal with OEM customers. TISAX is mandatory for suppliers working with VW, BMW, Mercedes, and most German OEMs. Start the process 6-9 months before you need the certificate.",
      "work_products": ["[TISAX-01] ISMS Documentation", "[TISAX-02] Risk Assessment", "[TISAX-03] Statement of Applicability"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "1",
      "title": "Information Security Policies",
      "guidance": "Requires documented information security policies approved by management. Key requirements: (1) Information security policy - high-level commitment and direction; (2) Topic-specific policies - detailed policies for access control, cryptography, supplier security, etc.; (3) Review cycle - policies must be reviewed at planned intervals or when significant changes occur; (4) Communication - policies must be communicated to employees and relevant external parties. Maps to ISO 27001 Clause 5.2 and ISO 21434 Clause 5. Tip: Your ISO 21434 cybersecurity policy can satisfy TISAX if it covers information security scope.",
      "work_products": ["[TISAX-04] Information Security Policy", "[TISAX-05] Topic-specific Policies"],
      "r155_mapping": ["7.2.2.2(a)"],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "2",
      "title": "Organization of Information Security",
      "guidance": "Establishes roles, responsibilities, and organizational structure for information security. Key elements: (1) Information Security Officer (ISO) - appointed with adequate authority and resources; (2) Segregation of duties - separate conflicting responsibilities; (3) Contact with authorities - procedures for reporting incidents to regulators; (4) Contact with special interest groups - engagement with Auto-ISAC, CERT communities; (5) Project management security - integrate security into all projects. For AL3 assessments, expect auditors to interview the ISO and verify their authority.",
      "work_products": ["[TISAX-06] Organizational Security Structure", "[TISAX-07] Roles and Responsibilities Matrix"],
      "r155_mapping": ["7.2.2.2(a)"],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "3",
      "title": "Human Resource Security",
      "guidance": "Covers security aspects of employee lifecycle. Key controls: (1) Screening - background checks appropriate to role sensitivity; (2) Terms of employment - security responsibilities in contracts; (3) Awareness training - regular security awareness programs; (4) Disciplinary process - consequences for security violations; (5) Termination procedures - access revocation, asset return. For prototype protection (Proto label), stricter screening may be required. Document training records and maintain evidence of awareness program completion.",
      "work_products": ["[TISAX-08] Security Awareness Program", "[TISAX-09] Employee Security Agreements"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "4",
      "title": "Asset Management",
      "guidance": "Requires identification and protection of information assets. Key requirements: (1) Asset inventory - maintain register of all information assets; (2) Ownership - assign owners responsible for asset protection; (3) Acceptable use - define rules for using assets; (4) Classification - label assets by sensitivity (public, internal, confidential, strictly confidential); (5) Media handling - procedures for removable media, disposal. For automotive: include CAD files, test data, calibration parameters, and customer technical information in scope.",
      "work_products": ["[TISAX-10] Asset Inventory", "[TISAX-11] Information Classification Scheme"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "5",
      "title": "Access Control",
      "guidance": "Establishes controls for accessing information systems. Key areas: (1) Access control policy - business requirements for access; (2) User access management - registration, provisioning, review, removal; (3) User responsibilities - password policy, clear desk; (4) System access controls - secure logon, session timeout, privilege restriction; (5) Application access - need-to-know enforcement. For AL3: expect technical verification of access controls, privileged access management, and multi-factor authentication for sensitive systems.",
      "work_products": ["[TISAX-12] Access Control Policy", "[TISAX-13] User Access Review Records"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "6",
      "title": "Cryptography",
      "guidance": "Governs use of cryptographic controls. Requirements: (1) Cryptographic policy - when and how to use encryption; (2) Key management - generation, distribution, storage, rotation, destruction; (3) Algorithm selection - use industry-standard algorithms (AES-256, RSA-2048+, SHA-256+); (4) Certificate management - PKI procedures if applicable. For automotive embedded systems: align with AUTOSAR Crypto Stack requirements. Document crypto inventory showing where encryption is used and with what algorithms.",
      "work_products": ["[TISAX-14] Cryptographic Policy", "[TISAX-15] Key Management Procedures"],
      "r155_mapping": ["7.3.8"],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "7",
      "title": "Physical and Environmental Security",
      "guidance": "Protects physical facilities and equipment. Key controls: (1) Secure areas - perimeter security, entry controls, securing offices; (2) Equipment security - siting, protection, maintenance, disposal; (3) Clear desk/screen - policy enforcement; (4) Cabling security - protect power and network cables. For prototype protection: dedicated secure rooms, visitor escort requirements, photography prohibitions, prototype tracking. AL3 assessments include physical site inspection.",
      "work_products": ["[TISAX-16] Physical Security Procedures", "[TISAX-17] Secure Area Register"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "8",
      "title": "Operations Security",
      "guidance": "Covers secure operation of information processing facilities. Key areas: (1) Documented procedures - operating procedures for IT systems; (2) Change management - controlled changes to systems; (3) Capacity management - monitoring and projections; (4) Separation of environments - dev/test/prod separation; (5) Malware protection - anti-virus, endpoint detection; (6) Backup - regular backups with testing; (7) Logging and monitoring - security event logging, log protection; (8) Vulnerability management - scanning, patching. For automotive: include vehicle test systems, HIL/SIL environments in scope.",
      "work_products": ["[TISAX-18] Operating Procedures", "[TISAX-19] Change Management Records", "[TISAX-20] Backup and Recovery Plan"],
      "r155_mapping": ["7.2.2.2(g)"],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "9",
      "title": "Communications Security",
      "guidance": "Protects information in networks. Requirements: (1) Network security management - network controls, segregation; (2) Information transfer - policies for email, file transfer, messaging; (3) Confidentiality agreements - NDAs with external parties; (4) Network services security - SLAs with network providers. For supplier data exchange: secure file transfer (SFTP, encrypted email), no customer data on public cloud without approval. VPN requirements for remote access to customer systems.",
      "work_products": ["[TISAX-21] Network Security Architecture", "[TISAX-22] Data Transfer Procedures"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "10",
      "title": "Supplier Relationships",
      "guidance": "Manages security in supplier relationships. Key requirements: (1) Supplier security policy - requirements for suppliers handling your data; (2) Supply chain security - addressing security through the chain; (3) Supplier agreements - security clauses in contracts; (4) Monitoring and review - ongoing supplier assessment. Critical for automotive tier structure: you must flow down TISAX-equivalent requirements to your sub-suppliers. Document supplier security assessments and maintain approved supplier list.",
      "work_products": ["[TISAX-23] Supplier Security Requirements", "[TISAX-24] Supplier Assessment Records"],
      "r155_mapping": ["7.2.2.5", "7.3.2"],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "11",
      "title": "Incident Management",
      "guidance": "Establishes incident response capabilities. Requirements: (1) Incident management process - detection, reporting, response, recovery; (2) Reporting procedures - internal and external notification; (3) Assessment and decision - severity classification; (4) Response procedures - containment, eradication, recovery; (5) Learning from incidents - post-incident review, improvements. For OEM customer data breaches: know your contractual notification timelines (often 24-72 hours). Maintain incident log and conduct tabletop exercises.",
      "work_products": ["[TISAX-25] Incident Response Plan", "[TISAX-26] Incident Log"],
      "r155_mapping": ["7.2.2.2(g)", "7.2.2.2(h)"],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "12",
      "title": "Business Continuity",
      "guidance": "Ensures information security during disruptions. Key elements: (1) Business continuity planning - maintain security during crisis; (2) Redundancy - backup systems for critical functions; (3) Testing - regular BCP testing and updates. For automotive suppliers: consider impact on customer production if your systems fail. Define RTOs (Recovery Time Objectives) aligned with customer requirements. Include cybersecurity scenarios (ransomware) in BCP testing.",
      "work_products": ["[TISAX-27] Business Continuity Plan", "[TISAX-28] BCP Test Records"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "13",
      "title": "Compliance",
      "guidance": "Ensures compliance with legal and contractual requirements. Areas covered: (1) Legal requirements - identify applicable laws (GDPR, export controls); (2) Intellectual property - respect IP rights, license compliance; (3) Privacy - personal data protection; (4) Cryptographic regulations - export/import controls on crypto; (5) Independent review - internal audit, external assessment. For TISAX: the assessment itself is a compliance verification. Maintain evidence of compliance monitoring between assessments.",
      "work_products": ["[TISAX-29] Compliance Register", "[TISAX-30] Internal Audit Records"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "tisax",
      "clause_id": "Proto",
      "title": "Prototype Protection",
      "guidance": "Additional requirements for protecting physical prototypes and test vehicles. Key controls: (1) Secure storage - locked facilities, access logging; (2) Transportation - covered transport, GPS tracking for vehicles; (3) Camouflage - disguising prototype features; (4) Photography prohibition - no photos in prototype areas; (5) Visitor management - strict escort requirements; (6) Destruction - secure disposal of prototype components. Required when handling OEM prototype parts or test vehicles. Assessment includes physical inspection of prototype handling areas.",
      "work_products": ["[TISAX-31] Prototype Protection Procedures", "[TISAX-32] Prototype Tracking Log"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "Overview",
      "title": "SAE J3061 Overview",
      "guidance": "SAE J3061 (2016) was the first automotive cybersecurity standard, predating ISO 21434. Key concepts: (1) Cybersecurity lifecycle - concept, development, production, operation, decommissioning; (2) Feature-based development - integrates with existing automotive processes; (3) Threat Analysis and Risk Assessment (TARA) - originated many concepts later refined in ISO 21434; (4) Guiding principles - defense in depth, least privilege, fail-safe. While superseded by ISO 21434 for new programs, J3061 is still referenced in legacy contracts and provides good introductory material. Many J3061 concepts map directly to ISO 21434.",
      "work_products": ["[J3061-01] Cybersecurity Plan", "[J3061-02] Threat Analysis Report"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "5",
      "title": "Guiding Principles",
      "guidance": "Foundational security principles for vehicle cybersecurity. Principles: (1) Defense in depth - multiple layers of security controls; (2) Least privilege - minimal access rights for functions; (3) Separation of domains - isolate critical from non-critical systems; (4) Fail-safe design - secure defaults, graceful degradation; (5) No security by obscurity - don't rely on hidden designs; (6) Simplicity - reduce attack surface through simple designs. These principles remain valid and should guide all automotive security architecture decisions.",
      "work_products": [],
      "r155_mapping": ["7.3.4"],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "6",
      "title": "Concept Phase",
      "guidance": "Initiates cybersecurity for a vehicle feature. Activities: (1) Item definition - scope, boundaries, interfaces; (2) Cybersecurity goals - high-level security objectives; (3) Preliminary TARA - initial threat identification; (4) Cybersecurity concept - high-level security architecture. Similar to ISO 21434 Clause 9 but with different terminology. J3061 uses 'feature' where ISO 21434 uses 'item'. The outputs feed into detailed design phase.",
      "work_products": ["[J3061-03] Item Definition", "[J3061-04] Cybersecurity Goals", "[J3061-05] Preliminary TARA"],
      "r155_mapping": ["7.3.3"],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "7",
      "title": "Development Phase",
      "guidance": "Detailed cybersecurity engineering during product development. Key activities: (1) System-level TARA - detailed threat analysis; (2) Security requirements - derived from TARA and cybersecurity goals; (3) Security architecture - detailed security design; (4) Security implementation - coding standards, secure coding; (5) Security testing - verification and validation. J3061 introduced the concept of security testing levels analogous to ISO 26262 ASIL decomposition.",
      "work_products": ["[J3061-06] Detailed TARA", "[J3061-07] Security Requirements", "[J3061-08] Security Test Plan"],
      "r155_mapping": ["7.3.4", "7.3.6"],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "8",
      "title": "Production Phase",
      "guidance": "Cybersecurity during manufacturing. Focus areas: (1) Secure manufacturing - protect keys, certificates, software; (2) Secure flashing - authenticated software installation; (3) Production security controls - physical and logical access; (4) End-of-line testing - verify security features work. Similar to ISO 21434 Clause 12 but less detailed. Key concern: protecting cryptographic material during production.",
      "work_products": ["[J3061-09] Production Security Plan"],
      "r155_mapping": ["7.2.2.1(b)"],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "9",
      "title": "Operation and Maintenance Phase",
      "guidance": "Cybersecurity for vehicles in the field. Key activities: (1) Vulnerability monitoring - track new vulnerabilities; (2) Incident response - detect and respond to attacks; (3) Security updates - patch vulnerabilities; (4) Field monitoring - collect security telemetry. J3061 was early in recognizing the need for post-production security monitoring. Maps to ISO 21434 Clause 8 (continual activities) and Clause 13 (operations).",
      "work_products": ["[J3061-10] Incident Response Plan", "[J3061-11] Vulnerability Management Plan"],
      "r155_mapping": ["7.2.2.2(g)", "7.2.2.2(h)"],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "10",
      "title": "Supporting Processes",
      "guidance": "Organizational processes supporting cybersecurity. Includes: (1) Cybersecurity governance - organizational structure, responsibilities; (2) Cybersecurity culture - awareness, training; (3) Tool qualification - security of development tools; (4) Supplier management - cybersecurity requirements for suppliers. Similar to ISO 21434 Clauses 5 and 7. J3061 was less prescriptive about organizational requirements than ISO 21434.",
      "work_products": ["[J3061-12] Cybersecurity Policy"],
      "r155_mapping": ["7.2.2.2(a)", "7.2.2.5"],
      "cal_relevant": 0
    },
    {
      "standard": "sae_j3061",
      "clause_id": "Annex A",
      "title": "TARA Method Examples",
      "guidance": "Provides example TARA methods. Methods described: (1) EVITA - uses attack trees and attack potential calculation; (2) HEAVENS - threat modeling with security levels; (3) TVRA - ETSI method adapted for vehicles; (4) Attack trees - hierarchical threat decomposition; (5) Misuse cases - extend use cases with attacker perspective. These methods influenced ISO 21434 Annex H. Choose a method that fits your organization's risk assessment experience.",
      "work_products": [],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "autosar",
      "clause_id": "Overview",
      "title": "AUTOSAR Cybersecurity Overview",
      "guidance": "AUTOSAR provides standardized security specifications for automotive ECUs. Key security components: (1) SecOC (Secure Onboard Communication) - message authentication for CAN, FlexRay, Ethernet; (2) Crypto Stack - standardized cryptographic services; (3) Key Manager - secure key storage and lifecycle; (4) Secure Boot - verified boot chain; (5) HSM integration - hardware security module abstraction. AUTOSAR security modules implement the technical controls required by ISO 21434 and R155. Understanding AUTOSAR is essential for ECU-level security implementation.",
      "work_products": [],
      "r155_mapping": ["7.3.4", "7.3.8"],
      "cal_relevant": 1
    },
    {
      "standard": "autosar",
      "clause_id": "SecOC",
      "title": "Secure Onboard Communication",
      "guidance": "SecOC provides message authentication for in-vehicle networks. Key features: (1) Message Authentication Code (MAC) - protects message integrity and authenticity; (2) Freshness Value - prevents replay attacks; (3) Truncated MAC - balance security vs. bandwidth; (4) Key management interface - integration with Key Manager. Configuration: Define security profiles per PDU (Protocol Data Unit), specify MAC length (24-128 bits), configure freshness management strategy. SecOC is mandatory for safety-critical and security-relevant communication per R155 threat mitigations.",
      "work_products": ["[AUTOSAR-01] SecOC Configuration", "[AUTOSAR-02] Security Profile Specification"],
      "r155_mapping": ["7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "autosar",
      "clause_id": "CSM",
      "title": "Crypto Service Manager",
      "guidance": "CSM provides standardized cryptographic services. Capabilities: (1) Symmetric encryption - AES (128/256-bit); (2) Asymmetric operations - RSA, ECC; (3) Hash functions - SHA-256, SHA-384; (4) MAC generation - CMAC, HMAC; (5) Random number generation - interface to hardware RNG; (6) Key management - key derivation, wrapping. CSM abstracts crypto hardware (HSM, SHE) providing portability. Configuration requires defining crypto jobs, primitives, and key elements. Always use hardware-backed crypto for production.",
      "work_products": ["[AUTOSAR-03] Crypto Service Configuration", "[AUTOSAR-04] Key Element Specification"],
      "r155_mapping": ["7.3.8"],
      "cal_relevant": 1
    },
    {
      "standard": "autosar",
      "clause_id": "KeyM",
      "title": "Key Manager",
      "guidance": "KeyM manages cryptographic keys throughout their lifecycle. Functions: (1) Key storage - secure storage in NVM or HSM; (2) Key derivation - derive session keys from master keys; (3) Key update - secure key rotation procedures; (4) Key verification - validate key integrity; (5) Certificate handling - X.509 certificate chain validation. Key hierarchy typically: Hardware Unique Key (HUK) → Master Key → Domain Keys → Session Keys. Design key hierarchy before implementation - changes are costly.",
      "work_products": ["[AUTOSAR-05] Key Hierarchy Design", "[AUTOSAR-06] Key Lifecycle Procedures"],
      "r155_mapping": ["7.3.8"],
      "cal_relevant": 1
    },
    {
      "standard": "autosar",
      "clause_id": "SecureBoot",
      "title": "Secure Boot",
      "guidance": "Verified boot ensures only authenticated software runs on ECU. Boot chain: (1) Hardware Root of Trust - immutable bootloader in ROM; (2) First-stage bootloader - verified by hardware; (3) Second-stage bootloader - verified by first stage; (4) Application - verified by bootloader. Each stage verifies the next using digital signatures (RSA/ECDSA). Failure handling: fail to safe state, log attempt, alert. Secure boot is a fundamental control for R155 compliance - prevents unauthorized firmware execution.",
      "work_products": ["[AUTOSAR-07] Secure Boot Design", "[AUTOSAR-08] Boot Chain Verification"],
      "r155_mapping": ["7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "autosar",
      "clause_id": "IdsM",
      "title": "Intrusion Detection System Manager",
      "guidance": "IdsM coordinates intrusion detection across the vehicle. Capabilities: (1) Security event collection - gather events from network, ECUs; (2) Event qualification - filter and prioritize events; (3) Event reporting - send to security operations center; (4) Local response - trigger defensive actions. Event sources: SecOC authentication failures, anomalous CAN traffic, diagnostic abuse, secure boot failures. IdsM is key for R155 Article 7.2.2.2(g) - monitoring for cyber threats. Define security event taxonomy aligned with VSOC requirements.",
      "work_products": ["[AUTOSAR-09] IDS Configuration", "[AUTOSAR-10] Security Event Taxonomy"],
      "r155_mapping": ["7.2.2.2(g)", "7.3.7"],
      "cal_relevant": 1
    },
    {
      "standard": "autosar",
      "clause_id": "Ethernet",
      "title": "Automotive Ethernet Security",
      "guidance": "Security for Ethernet-based in-vehicle networks. Standards: (1) MACsec (802.1AE) - Layer 2 encryption and authentication; (2) IPsec - Layer 3 security for IP traffic; (3) TLS - Transport layer security for TCP connections; (4) SOME/IP-SD security - service discovery protection. Automotive Ethernet enables higher bandwidth attacks than CAN. Implement network segmentation (VLANs), firewall rules between domains, and authentication for all cross-domain communication. Consider using MACsec for backbone traffic.",
      "work_products": ["[AUTOSAR-11] Ethernet Security Architecture", "[AUTOSAR-12] Network Segmentation Design"],
      "r155_mapping": ["7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "autosar",
      "clause_id": "Diagnostics",
      "title": "Secure Diagnostics",
      "guidance": "Security for UDS (Unified Diagnostic Services). Key concerns: (1) Authentication - SecurityAccess (0x27) with strong algorithms; (2) Authorization - restrict services by authentication level; (3) Secure boot unlock - controlled access to flash programming; (4) Diagnostic session management - timeout, logout. Common attacks target diagnostics for firmware extraction, calibration theft, odometer manipulation. Implement strong seed/key algorithms, rate limiting, and logging. Post-production diagnostic access is a key R155 threat vector.",
      "work_products": ["[AUTOSAR-13] Diagnostic Security Specification"],
      "r155_mapping": ["7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "gbt",
      "clause_id": "Overview",
      "title": "Chinese Automotive Cybersecurity Standards Overview",
      "guidance": "China has developed mandatory cybersecurity standards for vehicles sold in the Chinese market. Key standards: (1) GB/T 40857-2021 - Vehicle cybersecurity general technical requirements; (2) GB/T 40856-2021 - Software update engineering requirements; (3) GB/T 40855-2021 - Vehicle gateway security requirements; (4) GB 44495-2024 - Mandatory vehicle data security standard. These standards are heavily influenced by UNECE R155/R156 but adapted for Chinese regulatory context. Compliance is required for China Compulsory Certification (CCC) for connected vehicles. Work with Chinese testing labs (CATARC, CAERI) for certification.",
      "work_products": ["[GBT-01] Cybersecurity Compliance Documentation", "[GBT-02] China CCC Application Package"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "gbt",
      "clause_id": "40857",
      "title": "GB/T 40857-2021 Vehicle Cybersecurity Technical Requirements",
      "guidance": "Core cybersecurity requirements for intelligent connected vehicles. Structure mirrors R155 but with Chinese-specific requirements: (1) Organizational security - establish cybersecurity management system; (2) Vehicle development - threat analysis, security design, testing; (3) Production security - secure manufacturing processes; (4) Post-production - monitoring, incident response, updates; (5) Technical requirements - specific controls for communication, gateway, ECU security. Key difference from R155: more prescriptive technical requirements rather than risk-based approach. Applies to M and N category vehicles with connectivity features.",
      "work_products": ["[GBT-03] CSMS Documentation (Chinese)", "[GBT-04] Vehicle Type Security Assessment"],
      "r155_mapping": ["7.2", "7.3"],
      "cal_relevant": 0
    },
    {
      "standard": "gbt",
      "clause_id": "40857-5",
      "title": "GB/T 40857 Section 5: Organizational Requirements",
      "guidance": "Cybersecurity management system requirements for manufacturers. Requirements: (1) Cybersecurity policy - documented and approved by management; (2) Organizational structure - designated cybersecurity roles; (3) Resource allocation - adequate personnel and tools; (4) Competence requirements - staff training and qualification; (5) Supply chain security - requirements flow-down to suppliers; (6) Continuous improvement - regular review and update of CSMS. Similar to R155 Article 6 CSMS certificate requirements. Chinese authorities may audit CSMS implementation.",
      "work_products": ["[GBT-05] CSMS Policy (Chinese)", "[GBT-06] Organization Chart", "[GBT-07] Training Records"],
      "r155_mapping": ["7.2.2.2(a)", "7.2.2.5"],
      "cal_relevant": 0
    },
    {
      "standard": "gbt",
      "clause_id": "40857-6",
      "title": "GB/T 40857 Section 6: Vehicle Development Requirements",
      "guidance": "Security engineering during vehicle development. Key requirements: (1) Threat analysis - identify threats to vehicle systems; (2) Risk assessment - evaluate likelihood and impact; (3) Security concept - define security architecture; (4) Security requirements - derive from risk assessment; (5) Security design - implement controls; (6) Security verification - testing and validation. Requires documented evidence throughout development lifecycle. Testing must cover both functional security and penetration testing. Chinese labs will verify compliance through document review and vehicle testing.",
      "work_products": ["[GBT-08] Threat Analysis Report", "[GBT-09] Security Requirements Specification", "[GBT-10] Security Test Report"],
      "r155_mapping": ["7.3.3", "7.3.4", "7.3.6"],
      "cal_relevant": 0
    },
    {
      "standard": "gbt",
      "clause_id": "40857-7",
      "title": "GB/T 40857 Section 7: Technical Security Requirements",
      "guidance": "Specific technical controls required for vehicles. Areas covered: (1) External interface security - protect Bluetooth, WiFi, cellular, V2X; (2) Internal network security - gateway protection, network segmentation; (3) ECU security - secure boot, secure storage, secure communication; (4) Data security - encryption, access control, secure deletion; (5) Diagnostic security - authentication, authorization; (6) Update security - secure OTA implementation. More prescriptive than R155 - specifies minimum cryptographic algorithms (SM2/SM3/SM4 Chinese algorithms often required), authentication mechanisms, and network segmentation approaches.",
      "work_products": ["[GBT-11] Technical Security Architecture", "[GBT-12] Cryptographic Implementation Document"],
      "r155_mapping": ["7.3.4", "7.3.8"],
      "cal_relevant": 1
    },
    {
      "standard": "gbt",
      "clause_id": "40856",
      "title": "GB/T 40856-2021 Software Update Requirements",
      "guidance": "Requirements for vehicle software update systems (Chinese equivalent to R156). Key requirements: (1) Update management system - organizational processes for managing updates; (2) Secure update mechanism - authentication, integrity verification; (3) Rollback capability - ability to revert failed updates; (4) User notification - inform vehicle owners of updates; (5) Update logging - maintain audit trail; (6) OTA infrastructure security - secure backend systems. Applies to all vehicles capable of software updates. Requires demonstration that updates cannot be manipulated and failed updates don't compromise vehicle safety.",
      "work_products": ["[GBT-13] SUMS Documentation", "[GBT-14] OTA Security Architecture", "[GBT-15] Update Process Description"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "gbt",
      "clause_id": "40855",
      "title": "GB/T 40855-2021 Gateway Security Requirements",
      "guidance": "Security requirements for vehicle gateways. Gateway is critical security boundary. Requirements: (1) Access control - control traffic between network domains; (2) Message filtering - whitelist/blacklist for allowed messages; (3) Authentication - verify source of messages; (4) Anomaly detection - identify suspicious traffic patterns; (5) Secure boot - verify gateway firmware integrity; (6) Secure communication - protect inter-domain traffic; (7) Diagnostic protection - secure diagnostic routing. Chinese standards emphasize gateway as primary security control point. Expect detailed testing of gateway filtering rules during certification.",
      "work_products": ["[GBT-16] Gateway Security Specification", "[GBT-17] Gateway Test Report"],
      "r155_mapping": ["7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "gbt",
      "clause_id": "44495",
      "title": "GB 44495-2024 Vehicle Data Security",
      "guidance": "Mandatory standard for vehicle data security (effective 2026). This is a GB (mandatory) not GB/T (recommended) standard. Key requirements: (1) Data classification - categorize data by sensitivity; (2) Personal data protection - consent, minimization, anonymization; (3) Important data protection - data that affects national security, public interest; (4) Cross-border transfer - restrictions on exporting certain data; (5) Data localization - some data must be stored in China; (6) Security assessment - required for important data processing. Critical for connected vehicles: must implement data security controls and may need to establish China data centers. Consult with China data privacy lawyers.",
      "work_products": ["[GBT-18] Data Security Assessment", "[GBT-19] Data Classification Matrix", "[GBT-20] Cross-border Transfer Assessment"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "gbt",
      "clause_id": "Crypto",
      "title": "Chinese Cryptographic Requirements",
      "guidance": "China requires use of Chinese cryptographic algorithms in certain contexts. Key algorithms: (1) SM2 - elliptic curve cryptography (similar to ECDSA); (2) SM3 - hash function (similar to SHA-256); (3) SM4 - block cipher (similar to AES-128); (4) SM9 - identity-based cryptography. When required: government/public sector applications must use SM algorithms; commercial applications may have flexibility. Vehicle cybersecurity: check with certification body whether SM algorithms are required for your use case. Many implementations support dual-stack (SM + international algorithms). Hardware: look for chips supporting SM algorithms or use software implementations.",
      "work_products": ["[GBT-21] Cryptographic Algorithm Selection Rationale"],
      "r155_mapping": ["7.3.8"],
      "cal_relevant": 1
    },
    {
      "standard": "gbt",
      "clause_id": "Certification",
      "title": "China CCC Certification Process",
      "guidance": "Process for obtaining China Compulsory Certification for connected vehicles. Steps: (1) Select accredited testing lab (CATARC, CAERI, CAQC); (2) Submit application with technical documentation; (3) Factory audit - verify CSMS implementation; (4) Vehicle testing - functional and security testing; (5) Report review - lab submits to CNCA; (6) Certificate issuance - valid for 5 years; (7) Surveillance - annual factory audits. Timeline: 6-12 months from application to certificate. Cost: varies by vehicle type and lab. Tips: engage Chinese partner early, prepare documentation in Chinese, budget for multiple test iterations.",
      "work_products": ["[GBT-22] CCC Application Form", "[GBT-23] Factory Audit Checklist"],
      "r155_mapping": [],
      "cal_relevant": 0
    },
    {
      "standard": "gbt",
      "clause_id": "V2X",
      "title": "Chinese V2X Security Requirements",
      "guidance": "Security requirements for Vehicle-to-Everything communication in China. China uses C-V2X (cellular) technology, not DSRC. Key standards: (1) YD/T 3957 - LTE-V2X security; (2) T/CSAE 53-2020 - V2X PKI certificate policy; (3) T/ITS 0058 - V2X application security. Requirements: (1) PKI-based authentication - vehicles must have valid certificates; (2) Message signing - all V2X messages authenticated; (3) Certificate management - enrollment, update, revocation; (4) Privacy protection - pseudonym certificates. China V2X PKI is managed by designated Certificate Authorities. Foreign OEMs must work with Chinese CA system for V2X deployment.",
      "work_products": ["[GBT-24] V2X Security Architecture", "[GBT-25] Certificate Management Plan"],
      "r155_mapping": ["7.3.4"],
      "cal_relevant": 1
    },
    {
      "standard": "gbt",
      "clause_id": "Testing",
      "title": "Chinese Cybersecurity Testing Requirements",
      "guidance": "Testing requirements for GB/T compliance verification. Test categories: (1) Document review - verify CSMS, development process documentation; (2) Functional testing - verify security controls work as designed; (3) Penetration testing - attempt to bypass security controls; (4) Fuzz testing - malformed input testing; (5) Vulnerability scanning - automated vulnerability detection. Chinese labs follow national testing guidelines. Key labs: CATARC (Tianjin), CAERI (Chongqing), China Auto (Shanghai). Prepare test vehicles with debug access enabled. Testing typically takes 2-4 weeks per vehicle type. Plan for retesting if failures found.",
      "work_products": ["[GBT-26] Test Plan", "[GBT-27] Test Vehicle Specification"],
      "r155_mapping": ["7.3.6"],
      "cal_relevant": 0
    }
  ]
}
